Revit 2027 API
RebarConstraint.GetTargetHostEdgeAndTransform Method
 Returns the target host edge and the transform that is associated to the host edge's geometry. The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' or 'ToHostEdgeCover'. Only applied to Free Form Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TargetHostEdgeAndTransform GetTargetHostEdgeAndTransform(
	int targetIndex
)
Public Function GetTargetHostEdgeAndTransform (
	targetIndex As Integer
) As TargetHostEdgeAndTransform
public:
TargetHostEdgeAndTransform^ GetTargetHostEdgeAndTransform(
	int targetIndex
)
member GetTargetHostEdgeAndTransform :
        targetIndex : int -> TargetHostEdgeAndTransform
Parameters
targetIndex Int32
 The index of the target. Should be between 0 and NumberOfTargets().
Return Value
TargetHostEdgeAndTransform
 Returns the target host edge and the transform that is associated to the host edge's geometry.
Exceptions
Exception | Condition
ArgumentException |  targetIndex is out of range.
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToHostEdge' or 'ToHostEdgeCover'. -or- Constrained rebar isn't a Free Form Rebar element.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace